
// [
//     {
//         icon: "", // icon : '' | 'tired' | 'fun' | 'busy'
//         title: "",
//         content: "",
//         date: "" // yyyy-mm-dd 월 0PM
//     },
// ]

const timeLine = [
    {
        icon: "",
        title: "정처기 실기 접수 잊지말자",
        content: "6월 27일임! (시험은 7/22~8/6)<br>확실히.. 실기가 어려운지 필기는 합격률 50%였는데 실기는 20%네.. 잘 준비하자!",
        date: "2023-06-04 토 1AM"
    },
    {
        icon: "fun",
        title: "와악 정처기 필기 합격",
        content: "진쫘.. 밤샌보람있다. 아니 시험이 컴퓨터로 치는것도 모르고 가서 와.. 떨어지면 공개쳐형인거야?? 하고 진짜 떨어지지말자고 열심히 풀었는데 85, 75, 85, 75, 60으로 합격! 2주 벼락치기로 이게 되네..",
        date: "2023-06-01 목 1PM"
    },
    {
        icon: "fun",
        title: "시나공 기억상자",
        content: "앱 맘에든다..! 내가 좋아하던 복습방법이야",
        date: "2023-05-23 화 3PM"
    },
    {
        icon: "tired",
        title: "정처기 9일남았다! 1회독가능할까..ㅜ",
        content: "누워서 공부하면 30분만에 팔아프고 목아파서 집중이 자주 끊기니까 넘 화난다..앉고싶다.. 앉아서 4~6시간 방해없이 쭉 공부든 코딩이든 하고싶다..",
        date: "2023-05-23 화 3PM"
    },
    {
        icon: "",
        title: "잠안오넹.. 밤새 정처기 보면 되겠다",
        content: "그러다 잠오면 조금만 자고 '리액트를 다루는 기술 : 24장.시작 및 회원가입 인증 구현' 마저하자<br>- 현재 정처기: 40p복습, 40p학습..(220p)<br>앉아서 공부하고싶다..",
        date: "2023-05-19 금 4PM"
    },
    {
        icon: "fun",
        title: "ORM 단어 두번째로 마주쳤다!",
        content: "<a href='/myBoard/blog/?post=post4'>[프론트엔드 아키택처] API 요청 관리</a> 블로그 글 정리하면서 ORM이란게 있구나~ 하고 넘어갔는데 정보처리기사 필기 하면서 또 등장했다..! 반갑당",
        date: "2023-05-21 일 5AM"
    },
    {
        icon: "tired",
        title: "TIMELINE 만들기 성공적!",
        content: "- 스크롤이 끝나기 전에 내용 추가 되도록 구현!<br>- 글자가 많으면 줄여보여주고 '+더보기' 버튼으로 볼 수 있도록 구현!<br><br><br>쨘!🤗",
        date: "2023-05-20 토 11PM"
    },
    {
        icon: "busy",
        title: "정처기 10장읽는데 1시간 걸리네",
        content: "다 읽을 순 있겠지..?<br>벼락치기를 해본적이없어서 벼락공부 방법을 모르겠다..ㅠㅠ 벼락치기도 해본 친구들이 잘하겠구나",
        date: "2023-05-19 금 7PM"
    },
    {
        icon: "",
        title: "오류 못찾겠을 때 : import도 확인하자",
        content: "리덕스 사가로 미들웨어를 적용하고 동작확인하는데 아무 동작도, 아무 오류도 안떠서 해결하는데 한참 걸렸다.. 미들웨어 만드는게 처음이라 실수한줄 알고 책 다시 살펴보고, 콘솔 찍어가며 동작 안하는 부분을 찾아도 내가 만든 미들웨어만 적용이 안되서 코드상에 실수가 있는거같은데 못 찾겠어서 챗지피티까지 써가면서 확인했는데 (틀린게 없다는것만 확인됨ㅋㅋ.. 다행인가?) <br>그러다 한참뒤에 찾은 실수는 import 실수였다😑 자동 import 너를 믿었는데.. 다음엔 import도 제대로 되었는지 확인을 해봐야겠다. 이런적이 없어서... 진짜 당황했네",
        date: "2023-05-19 금 4PM"
    },
    {
        icon: "fun",
        title: "수야 업무 퍼블리싱 도와줌",
        content: "이 정도 퍼블리싱 해줄 수 있찌! 나 디자인도 프엔도 잘 할 수 있는데!! 빨리 건강해져서 일하고 싶다.. <br>일해라 세포!!",
        date: "2023-05-19 금 2AM"
    },
];

export default timeLine;