
// [
//     {
//         icon: "", // icon : '' | 'tired' | 'fun' | 'busy'
//         title: "",
//         content: "",
//         date: "" // yyyy-mm-dd 월 0PM
//     },
// ]

const timeLine = [
    {
        icon: "tired",
        title: "TIMELINE 만들기 성공적!",
        content: "- 스크롤이 끝나기 전에 내용 추가 되도록 구현!<br>- 글자가 많으면 줄여보여주고 '+더보기' 버튼으로 볼 수 있도록 구현!<br><br><br>쨘!🤗",
        date: "2023-05-20 토 11PM"
    },
    {
        icon: "busy",
        title: "정처기 10장읽는데 1시간 걸리네",
        content: "다 읽을 순 있겠지..?<br>벼락치기를 해본적이없어서 벼락공부 방법을 모르겠다..ㅠㅠ 벼락치기도 해본 친구들이 잘하겠구나",
        date: "2023-05-19 금 7PM"
    },
    {
        icon: "",
        title: "오류 못찾겠을 때 : import도 확인하자",
        content: "리덕스 사가로 미들웨어를 적용하고 동작확인하는데 아무 동작도, 아무 오류도 안떠서 해결하는데 한참 걸렸다.. 미들웨어 만드는게 처음이라 실수한줄 알고 책 다시 살펴보고, 콘솔 찍어가며 동작 안하는 부분을 찾아도 내가 만든 미들웨어만 적용이 안되서 코드상에 실수가 있는거같은데 못 찾겠어서 챗지피티까지 써가면서 확인했는데 (틀린게 없다는것만 확인됨ㅋㅋ.. 다행인가?) <br>그러다 한참뒤에 찾은 실수는 import 실수였다😑 자동 import 너를 믿었는데.. 다음엔 import도 제대로 되었는지 확인을 해봐야겠다. 이런적이 없어서... 진짜 당황했네",
        date: "2023-05-19 금 4PM"
    },
    {
        icon: "fun",
        title: "수야 업무 퍼블리싱 도와줌",
        content: "이 정도 퍼블리싱 해줄 수 있찌! 나 디자인도 프엔도 잘 할 수 있는데!! 빨리 건강해져서 일하고 싶다.. <br>일해라 세포!!",
        date: "2023-05-19 금 2AM"
    },
    {
        icon: "tired",
        title: "테스트를 위한 더미5",
        content: "뫄 한 방에 잘돼라!",
        date: "2023-05-20 토 8PM"
    },
    {
        icon: "",
        title: "테스트를 위한 더미6",
        content: "뫄 한 방에 잘돼라!",
        date: "2023-05-20 토 8PM"
    },
    {
        icon: "fun",
        title: "테스트를 위한 더미7",
        content: "뫄 한 방에 잘돼라!",
        date: "2023-05-20 토 8PM"
    },
    {
        icon: "tired",
        title: "테스트를 위한 더미8",
        content: "뫄 한 방에 잘돼라!",
        date: "2023-05-20 토 8PM"
    },
    {
        icon: "busy",
        title: "테스트를 위한 더미9",
        content: "뫄 한 방에 잘돼라!",
        date: "2023-05-20 토 8PM"
    },
    {
        icon: "",
        title: "테스트를 위한 더미10",
        content: "뫄 한 방에 잘돼라!",
        date: "2023-05-20 토 8PM"
    },
    {
        icon: "fun",
        title: "테스트를 위한 더미11",
        content: "뫄 한 방에 잘돼라!",
        date: "2023-05-20 토 8PM"
    },
    {
        icon: "busy",
        title: "테스트를 위한 더미12",
        content: "뫄 한 방에 잘돼라!",
        date: "2023-05-20 토 8PM"
    },
    {
        icon: "tired",
        title: "테스트를 위한 더미13",
        content: "뫄 한 방에 잘돼라!",
        date: "2023-05-20 토 8PM"
    },
    {
        icon: "",
        title: "테스트를 위한 더미14",
        content: "뫄 한 방에 잘돼라!",
        date: "2023-05-20 토 8PM"
    },
    {
        icon: "fun",
        title: "테스트를 위한 더미15",
        content: "뫄 한 방에 잘돼라!",
        date: "2023-05-20 토 8PM"
    },
    {
        icon: "tired",
        title: "테스트를 위한 더미16",
        content: "뫄 한 방에 잘돼라!",
        date: "2023-05-20 토 8PM"
    },
    {
        icon: "busy",
        title: "테스트를 위한 더미17",
        content: "뫄 한 방에 잘돼라!",
        date: "2023-05-20 토 8PM"
    },
    {
        icon: "",
        title: "테스트를 위한 더미18",
        content: "뫄 한 방에 잘돼라!",
        date: "2023-05-20 토 8PM"
    },
    {
        icon: "fun",
        title: "테스트를 위한 더미19",
        content: "뫄 한 방에 잘돼라!",
        date: "2023-05-20 토 8PM"
    },
    {
        icon: "tired",
        title: "테스트를 위한 더미20",
        content: "뫄 한 방에 잘돼라!",
        date: "2023-05-20 토 8PM"
    },
];

export default timeLine;